{"config": [{"config": {"dtype": "float32", "merge_mode": "concat", "trainable": true, "layer": {"config": {"recurrent_activation": "hard_sigmoid", "implementation": 0, "kernel_regularizer": null, "activity_regularizer": null, "go_backwards": false, "trainable": true, "recurrent_dropout": 0.5, "return_sequences": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "tanh", "dropout": 0.5, "kernel_constraint": null, "name": "lstm_3", "recurrent_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "units": 64, "use_bias": true, "bias_regularizer": null, "unroll": false}, "class_name": "LSTM"}, "name": "bidirectional_3", "batch_input_shape": [null, 10, 300]}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "layer": {"config": {"kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "units": 9, "name": "dense_2", "bias_regularizer": null}, "class_name": "Dense"}, "name": "time_distributed_2"}, "class_name": "TimeDistributed"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}